{
  "menu": {
    "aboutMe": "Über mich",
    "skills": "Fähigkeiten",
    "projects": "Projekte"
  },
  "headline": {
    "title": "Frontend Entwickler",
    "name": "Mike Schauber",
    "checkWork": "Zu meinen Projekten",
    "contactMe": "Kontaktiere mich"
  },
  "banner": {
    "1": "Frontend-Entwickler",
    "2": "Remote & vor Ort",
    "3": "Tübingen",
    "4": "Moderne Webtech",
    "5": "Nutzerorientiert",
    "6": "Kreativ & lösungsorientiert"
  },
  "aboutMe": {
    "whoIAm": "Wer ich bin",
    "aboutMeTitle": "Über mich",
    "intro": "Hallo, ich bin ein deutschsprachiger Frontend-Entwickler mit Sitz in Tübingen. Angetrieben von den grenzenlosen Möglichkeiten in der IT freue ich mich darauf, visuell ansprechende und intuitive Websites und Anwendungen zu gestalten.",
    "flexibleLocation": "Ich bin flexibel in Bezug auf die Arbeitsumgebung und arbeite sowohl vor Ort als auch remote effektiv. Vor Ort zu sein, ist jedoch meine bevorzugte Arbeitsweise.",
    "openMinded": "Ich bin aufgeschlossen und immer auf der Suche nach persönlichen Herausforderungen, um mein Wissen und meine Fähigkeiten ständig zu verbessern.",
    "creativeProblemSolving": "In meinem Beruf geht es beim Programmieren nicht nur darum, Code zu schreiben; es ist eine kreative Form der Problemlösung. Ich bin stolz auf meine Fähigkeit, komplexe technische Herausforderungen in einfache, benutzerfreundliche Lösungen zu verwandeln. Auf diese Weise helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken."
  },
  "skillset": {
    "skills": "Technologien",
    "skillSet": "Stärken",
    "description": "Mein Weg hat mich durch verschiedene Projekte geführt, bei denen ich eine Reihe von Frontend-Technologien und Konzepten angewendet habe. Ich bin offen für neue Technologien und Methoden, um meine Fähigkeiten kontinuierlich zu verbessern und in der sich ständig weiterentwickelnden Welt der Webentwicklung vorne zu bleiben.",
    "anotherSkillText": "Brauchen Sie",
    "anotherSkillSpan": "andere Fähigkeiten ?",
    "contactText": "Kontaktieren Sie mich gerne. Ich freue mich darauf, mein Wissen zu erweitern.",
    "letsTalk": "Lass uns reden",
    "interest": "Ich habe ein besonderes Interesse diese Technologien zu erlernen"
  },
  "portfolio": {
    "title": "Portfolio",
    "featuredProjects": "Meine Projekte",
    "description": "Entdecken Sie hier eine Auswahl meiner Arbeiten - interagieren Sie mit den Projekten, um die Projekte zu testen."
  },
  "projects": {
    "about": "Worum geht es bei diesem Projekt?",
    "next": "Nächstes Projekt"
  },
  "join": {
    "description": "Task-Manager, inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben mit Drag-and-Drop-Funktionen, weise Benutzer und Kategorien zu."
  },
  "sharky": {
    "description": "Ein einfaches Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf Sharkie, Münzen und Giftflaschen zu finden, um gegen den Killerwal zu kämpfen."
  },
  "pokedex": {
    "description": "Basierend auf der PokéAPI, eine einfache Bibliothek, die Pokémon-Informationen bereitstellt und katalogisiert."
  },
  "quotes": {
    "headline": "Wie meine Kollegen mich sehen",
    "quote_1": "Mike war ein angenehmer Teamkollege, der immer aufmerksam zuhörte und wertvollen Input lieferte. Seine proaktive Herangehensweise war besonders beeindruckend.",
    "quote_2": "Mikes 2D-Spiel Sharkie überzeugt durch flüssiges Gameplay und ansprechende Optik. Es hat viel Spaß gemacht, es zu testen.",
    "quote_3": "Die Animationen in Mikes Projekt Join waren unterhaltsam und kreativ. Die Möglichkeit, Aufgaben ohne Drag-and-Drop zu bearbeiten, war eine praktische Alternative."
  },
  "formular": {
    "title": "Schreiben Sie mir",
    "subtitle": "Gemeinsam ans Werk",
    "problem": "Brauchen Sie Hilfe bei einem Problem?",
    "description": "Kontaktieren Sie mich über dieses Formular, ich freue mich, von Ihnen zu hören, Ihre Ideen zu erfahren und zu Ihren Projekten beizutragen.",
    "frontendDeveloper": "Brauchen Sie einen Frontend-Entwickler?",
    "talk": "Reden wir darüber!",
    "success": "Email wurde erfolgreich versendet :)"
  },
  "input": {
    "name": "Wie ist Ihr Name?",
    "email": "Wie lautet Ihre E-Mail?",
    "help": "Wie kann ich Ihnen helfen?",
    "placeholderName": "Ihr Name kommt hierhin",
    "placeholderEmail": "Ihreemail@email.com",
    "placeholderHelp": "Hallo Mike, ich bin interessiert an...",
    "privacy1": "Ich habe die",
    "privacy2": "Datenschutzerklärung",
    "privacy3": "gelesen und stimme der Verarbeitung meiner Daten gemäß den Angaben zu.",
    "submitButton": "Nachricht senden :)",
    "errorName": "Ihr Name darf nicht fehlen",
    "errorEmail": "Hoppla! Ihre E-Mail ist erforderlich",
    "errorMessage": "Womit kann ich Ihnen helfen?",
    "privacyCheck": "Bitte akzeptieren Sie die Datenschutzrichtlinie."
  },
  "footer": {
    "legalnotice": "Impressum"
  },
  "impressum": {
    "title": "Impressum",
    "paragraph1": "Angaben gemäß § 5 DDG",
    "contactName": "Mike Schauber",
    "address": "Edelmannsweg 62",
    "city": "72116 Mössingen",
    "representedBy": "Vertreten durch",
    "contact": "Kontakt",
    "phone": "Telefon: 01520-6664892",
    "email": "kontakt@mikeschauber.de",
    "liabilityDisclaimer": "Haftungsausschluss",
    "liabilityForContent": "Haftung für Inhalte",
    "contentDisclaimer": "Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 DDG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
    "liabilityForLinks": "Haftung für Links",
    "linksDisclaimer": "Unser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
    "copyright": "Urheberrecht",
    "copyrightNotice": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",
    "privacyPolicy": "Datenschutz",
    "dataProtection": "Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder eMail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben.",
    "emailSecurity": "Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.",
    "adDisclaimer": "Der Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.",
    "generatedBy": "Website Impressum erstellt durch",
    "from": "von der"
  },
  "privacy": {
    "title": "Datenschutzerklärung",
    "date": "Stand: 22. September 2024",
    "contents": "Inhaltsverzeichnis",
    "responsible": "Verantwortlicher",
    "name": "Mike Schauber",
    "address": "Edelmannsweg 62",
    "city": "72116 Mössingen",
    "email": "E-Mail-Adresse",
    "imprint": "Impressum",
    "processing_overview": "Übersicht der Datenverarbeitung",
    "processing_summary": "Die folgende Übersicht fasst die Arten der verarbeiteten Daten und die Zwecke ihrer Verarbeitung zusammen.",
    "data_types": "Verarbeitete Datentypen",
    "data_types_1": "Kontaktdaten (z.B. Name, E-Mail)",
    "data_types_2": "Nutzerdaten",
    "data_types_3": "Nutzungsdaten (z.B. IP-Adresse, Browsertyp)",
    "data_types_4": "Inhaltsdaten (z.B. Nachrichten, Kommentare)",
    "data_types_5": "Kommunikationsdaten",
    "data_types_6": "Meta-/Kommunikationsdaten",
    "subjects_1": "Nutzer des Dienstes",
    "subjects_2": "Besucher der Website",
    "processing_purposes": "Verarbeitungszwecke",
    "purpose_1": "Bereitstellung des Dienstes",
    "purpose_2": "Verbesserung des Dienstes",
    "purpose_3": "Kommunikation mit Nutzern",
    "purpose_4": "Analyse und Statistik",
    "purpose_5": "Sicherheitsmaßnahmen",
    "purpose_6": "Erfüllung rechtlicher Verpflichtungen",
    "legal_basis_summary": "Die Verarbeitung personenbezogener Daten erfolgt auf Grundlage der folgenden Rechtsgrundlagen:",
    "contract_fulfillment": "Vertragserfüllung",
    "contract_fulfillment_details": "Die Verarbeitung ist zur Erfüllung eines Vertrages mit der betroffenen Person erforderlich.",
    "legitimate_interests": "Berechtigte Interessen",
    "legitimate_interests_details": "Die Verarbeitung ist zur Wahrung berechtigter Interessen des Verantwortlichen erforderlich.",
    "national_regulations": "Nationale Vorschriften",
    "national_regulations_details": "Zusätzlich zur DSGVO können weitere nationale Datenschutzbestimmungen gelten.",
    "notice_on_gdpr": "Hinweis zur DSGVO",
    "notice_on_gdpr_details": "Nutzer haben bestimmte Rechte im Hinblick auf ihre personenbezogenen Daten gemäß der DSGVO.",
    "security_measures": "Sicherheitsmaßnahmen",
    "security_measures_summary": "Wir ergreifen angemessene Sicherheitsmaßnahmen zum Schutz personenbezogener Daten.",
    "security_measures_details": "Dies umfasst technische und organisatorische Maßnahmen zur Verhinderung von unbefugtem Zugriff und Missbrauch.",
    "international_transfers": "Internationale Datenübermittlungen",
    "international_transfers_summary": "Wir können personenbezogene Daten in Länder außerhalb der EU/EWR übermitteln.",
    "eu_commission": "Europäische Kommission: Internationale Dimension des Datenschutzes",
    "data_storage": "Datenspeicherung",
    "data_storage_summary": "Wir speichern personenbezogene Daten nur so lange, wie es für die Zwecke erforderlich ist.",
    "data_storage_exceptions": "Ausnahmen können aufgrund gesetzlicher Verpflichtungen gelten.",
    "data_storage_additional": "Weitere Einzelheiten zur Datenspeicherung und -löschung finden Sie in unseren internen Richtlinien.",
    "data_storage_duration": "Wir speichern personenbezogene Daten für die Dauer, die zur Erfüllung der Zwecke, für die wir sie erhoben haben, erforderlich ist.",
    "data_storage_start": "Die Speicherdauer beginnt mit der Datenerhebung.",
    "data_storage_purpose": "Die Daten werden für die in dieser Erklärung genannten Zwecke gespeichert.",
    "additional_notes": "Weitere Hinweise",
    "storage_terms": "Aufbewahrungsfristen",
    "storage_years": "Jahre",
    "storage_years_business": "Jahre für Geschäftsdaten",
    "storage_years_contracts": "Jahre für vertragsbezogene Daten",
    "rights": "Rechte der betroffenen Personen",
    "rights_summary": "Betroffene Personen haben nach den Datenschutzgesetzen folgende Rechte:",
    "right_to_object": "Recht auf Widerspruch gegen die Verarbeitung",
    "right_of_withdrawal": "Recht auf Widerruf der Einwilligung",
    "right_to_information": "Recht auf Auskunft",
    "right_to_correction": "Recht auf Berichtigung",
    "right_to_deletion": "Recht auf Löschung",
    "right_to_data_transfer": "Recht auf Datenübertragbarkeit",
    "complaint": "Recht auf Beschwerde bei einer Aufsichtsbehörde.",
    "online_services": "Online-Dienste",
    "online_services_summary": "Wir verarbeiten personenbezogene Daten, wenn Sie unsere Online-Dienste nutzen.",
    "processed_data": "Verarbeitete Daten",
    "processed_data_details": "Dies kann Registrierungsdaten, Nutzungsdaten und Kommunikationsdaten umfassen.",
    "data_subjects": "Kategorien betroffener Personen",
    "data_subjects_details": "Nutzer unserer Online-Dienste.",
    "processing_purpose": "Zweck der Verarbeitung",
    "processing_purpose_details": "Zur Bereitstellung und Verbesserung unserer Dienste.",
    "storage_and_deletion": "Speicherung und Löschung",
    "storage_and_deletion_details": "Die Daten werden so lange gespeichert, wie es erforderlich ist, und anschließend gelöscht.",
    "legal_basis": "Rechtsgrundlage der Verarbeitung",
    "legal_basis_details": "Wir verarbeiten Daten auf Grundlage von Einwilligung, vertraglicher Notwendigkeit oder berechtigten Interessen.",
    "logfiles": "Logfiles",
    "logfiles_details": "Logfiles können zu Sicherheits- und Analysezwecken erstellt werden.",
    "contact_management": "Kontaktverwaltung",
    "contact_management_summary": "Wir verarbeiten personenbezogene Daten bei der Verwaltung von Kontakten.",
    "processed_data_types": "Verarbeitete Datentypen",
    "processed_data_types_details": "Kontaktdaten und Kommunikationsdaten.",
    "data_subjects_contact": "Nutzer, die mit uns interagieren.",
    "processing_purpose_contact": "Zur Verwaltung und Beantwortung von Anfragen.",
    "storage_and_deletion_contact": "Die Daten werden gemäß den gesetzlichen Anforderungen gespeichert und gelöscht.",
    "legal_basis_contact": "Rechtsgrundlage für die Verarbeitung von Kontaktdaten.",
    "contact_form": "Kontaktformular",
    "contact_details": "Die im Kontaktformular angegebenen Daten werden verarbeitet.",
    "contact_details_info": "Dies kann Name, E-Mail-Adresse und Nachrichteninhalt umfassen.",
    "privacy_generator": "Erstellt mit Datenschutz Generator",
    "generated_with": "Erstellt mit Hilfe des Datenschutz Generators"
  }
}
