{
  "menu": {
    "aboutMe": "Über mich",
    "skills": "Fähigkeiten",
    "projects": "Projekte"
  },
  "headline": {
    "title": "Frontend Entwickler",
    "name": "Mike Schauber",
    "checkWork": "Zu meinen Projekten",
    "contactMe": "Kontaktiere mich"
  },
  "banner": {
    "1": "Offen für Remote-Arbeit",
    "2": "Frontend-Entwickler",
    "3": "Ansässig in Tübingen",
    "4": "Offen für eine Stelle"
  },
  "aboutMe": {
    "whoIAm": "Wer ich bin",
    "aboutMeTitle": "Über mich",
    "intro": "Hallo, ich bin ein deutschsprachiger Frontend-Entwickler mit Sitz in Tübingen. Angetrieben von den grenzenlosen Möglichkeiten in der IT freue ich mich darauf, visuell ansprechende und intuitive Websites und Anwendungen zu gestalten.",
    "flexibleLocation": "Flexibel in Bezug auf Arbeitsumgebungen kann ich sowohl vor Ort, als auch remote effektiv arbeiten.",
    "openMinded": "Ich bin aufgeschlossen und immer auf der Suche nach persönlichen Herausforderungen, um mein Wissen und meine Fähigkeiten ständig zu verbessern.",
    "creativeProblemSolving": "In meinem Beruf geht es beim Programmieren nicht nur darum, Code zu schreiben; es ist eine kreative Form der Problemlösung. Ich bin stolz auf meine Fähigkeit, komplexe technische Herausforderungen in einfache, benutzerfreundliche Lösungen zu verwandeln. Auf diese Weise helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken."
  },
  "skillset": {
    "skills": "Technologien",
    "skillSet": "Stärken",
    "description": "Mein Weg hat mich durch verschiedene Projekte geführt, bei denen ich eine Reihe von Frontend-Technologien und Konzepten angewendet habe. Ich bin offen für neue Technologien und Methoden, um meine Fähigkeiten kontinuierlich zu verbessern und in der sich ständig weiterentwickelnden Welt der Webentwicklung vorne zu bleiben.",
    "anotherSkillText": "Brauchen Sie",
    "anotherSkillSpan": "andere Fähigkeiten ?",
    "contactText": "Kontaktieren Sie mich gerne. Ich freue mich darauf, mein Wissen zu erweitern.",
    "letsTalk": "Lass uns reden",
    "interest": "Ich habe ein besonderes Interesse diese Technologien zu erlernen"
  },
  "portfolio": {
    "title": "Portfolio",
    "featuredProjects": "Meine Projekte",
    "description": "Entdecken Sie hier eine Auswahl meiner Arbeiten - interagieren Sie mit den Projekten, um die Projekte zu testen."
  },
  "projects": {
    "about": "Worum geht es bei diesem Projekt?",
    "next": "Nächstes Projekt"
  },
  "join": {
    "description": "Task-Manager, inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben mit Drag-and-Drop-Funktionen, weise Benutzer und Kategorien zu."
  },
  "sharky": {
    "description": "Ein einfaches Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf Sharkie, Münzen und Giftflaschen zu finden, um gegen den Killerwal zu kämpfen."
  },
  "pokedex": {
    "description": "Basierend auf der PokéAPI, eine einfache Bibliothek, die Pokémon-Informationen bereitstellt und katalogisiert."
  },
  "quotes": {
    "headline": "Wie meine Kollegen mich sehen",
    "quote_1": "Mike war ein angenehmer Teamkollege, der immer aufmerksam zuhörte und wertvollen Input lieferte. Seine proaktive Herangehensweise war besonders beeindruckend.",
    "quote_2": "Mikes 2D-Spiel Sharkie überzeugt durch flüssiges Gameplay und ansprechende Optik. Es hat viel Spaß gemacht, es zu testen.",
    "quote_3": "Die Animationen in Mikes Projekt Join waren unterhaltsam und kreativ. Die Möglichkeit, Aufgaben ohne Drag-and-Drop zu bearbeiten, war eine praktische Alternative."
  },
  "formular": {
    "title": "Schreiben Sie mir",
    "subtitle": "Gemeinsam ans Werk",
    "problem": "Brauchen Sie Hilfe bei einem Problem?",
    "description": "Kontaktieren Sie mich über dieses Formular, ich freue mich, von Ihnen zu hören, Ihre Ideen zu erfahren und zu Ihren Projekten beizutragen.",
    "frontendDeveloper": "Brauchen Sie einen Frontend-Entwickler?",
    "talk": "Reden wir darüber!"
  },
  "input": {
    "name": "Wie ist Ihr Name?",
    "email": "Wie lautet Ihre E-Mail?",
    "help": "Wie kann ich Ihnen helfen?",
    "placeholderName": "Ihr Name kommt hierhin",
    "placeholderEmail": "Ihreemail@email.com",
    "placeholderHelp": "Hallo Mike, ich bin interessiert an...",
    "privacy1": "Ich habe die",
    "privacy2": "Datenschutzerklärung",
    "privacy3": "gelesen und stimme der Verarbeitung meiner Daten gemäß den Angaben zu.",
    "submitButton": "Sag Hallo ;)",
    "errorName": "Ihr Name darf nicht fehlen",
    "errorEmail": "Hoppla! Ihre E-Mail ist erforderlich",
    "errorMessage": "Womit kann ich Ihnen helfen?"
  },
  "footer": {
    "legalnotice": "Impressum"
  }
}
