{
  "menu": {
    "aboutMe": "About me",
    "skills": "Skills",
    "projects": "Projects"
  },
  "headline": {
    "title": "Frontend Developer",
    "name": "Mike Schauber",
    "checkWork": "Check my work",
    "contactMe": "Contact me"
  },
  "banner": {
    "1": "Frontend Developer",
    "2": "Remote & on-site",
    "3": "Tübingen",
    "4": "Modern Web Tech",
    "5": "User-oriented",
    "6": "Creative & solution-oriented"
  },
  "aboutMe": {
    "whoIAm": "Who I Am",
    "aboutMeTitle": "About Me",
    "intro": "Hi, I’m a German-speaking Frontend Developer based in Tübingen. Motivated by the limitless opportunities within IT, I am excited about crafting visually captivating and intuitive websites and applications.",
    "flexibleLocation": "I am flexible regarding work environments and can work effectively both on-site and remotely. However, I prefer working on-site.",
    "openMinded": "I am open-minded and always looking for personal challenges to constantly improve my knowledge and skills.",
    "creativeProblemSolving": "In my profession, programming isn't just about writing code; it's a creative form of problem-solving. I take pride in my ability to distill complex technical challenges into simple, user-friendly solutions. This way, I help you achieve your goals and bring your visions to life."
  },
  "skillset": {
    "skills": "Technologies",
    "skillSet": "Skill Set",
    "description": "My journey has involved working on diverse projects, employing a range of frontend technologies and concepts. I am open to embracing new technologies and methodologies to continuously enhance my skills and stay ahead in the ever-evolving landscape of web development.",
    "anotherSkillText": "You need",
    "anotherSkillSpan": "another skill?",
    "contactText": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
    "letsTalk": "Let's Talk",
    "interest": "I have a special interest in learning"
  },
  "portfolio": {
    "title": "Portfolio",
    "featuredProjects": "Featured Projects",
    "description": "Explore a selection of my work here - interact with projects to see my skills in action"
  },
  "projects": {
    "about": "What is this project about ?",
    "next": "Next project"
  },
  "join": {
    "description": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories."
  },
  "sharky": {
    "description": "A simple Jump-and-Run game based on an object-oriented approach. Help sharkie to find coins and poison bottles to fight against the killer whale."
  },
  "pokedex": {
    "description": "Based on the PokéAPI a simple library that provides and catalogues pokemon information."
  },
  "quotes": {
    "headline": "What my colleagues say about me",
    "quote_1": "Mike was a pleasant teammate who always listened attentively and provided valuable input. His proactive approach was particularly impressive.",
    "quote_2": "Mike's 2D game Sharkie stands out with smooth gameplay and appealing visuals. Testing it was a lot of fun.",
    "quote_3": "The animations in Mike's Join project were fun and creative. The option to edit tasks without drag-and-drop was a practical alternative."
  },
  "formular": {
    "title": "Contact me",
    "subtitle": "Let's work together",
    "problem": "Got a problem to solve?",
    "description": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to your projects with my work.",
    "frontendDeveloper": "Need a Frontend developer?",
    "talk": "Let’s talk!",
    "success": "Email was sent successfully :)"
  },
  "input": {
    "name": "What's your name?",
    "email": "What's your email?",
    "help": "How can I help you?",
    "placeholderName": "your name goes here",
    "placeholderEmail": "youremail@email.com",
    "placeholderHelp": "Hello Mike, I am interested in...",
    "privacy1": "I've read the",
    "privacy2": "privacy policy",
    "privacy3": "and agree to the processing of my data as outlined.",
    "submitButton": "Send message :)",
    "errorName": "Oops! It seems your name is missing",
    "errorEmail": "Hoppla! Your email is required",
    "errorMessage": "What do you need to develop?",
    "privacyCheck": "Please accept the privacy policy"
  },
  "footer": {
    "legalnotice": "Legal notice"
  },
  "impressum": {
    "title": "Legal Notice",
    "paragraph1": "Information according to § 5 DDG",
    "contactName": "Mike Schauber",
    "address": "Edelmannsweg 62",
    "city": "72116 Mössingen",
    "representedBy": "Represented by",
    "contact": "Contact",
    "phone": "Phone: 01520-6664892",
    "email": "kontakt@mikeschauber.de",
    "liabilityDisclaimer": "Disclaimer",
    "liabilityForContent": "Liability for Content",
    "contentDisclaimer": "The contents of our pages were created with great care. However, we cannot assume any liability for the accuracy, completeness, and timeliness of the content. As a service provider, we are responsible for our own content on these pages according to general laws, as per § 7 Abs.1 DDG. According to §§ 8 to 10 DDG, we are not obliged to monitor transmitted or stored external information or to investigate circumstances indicating illegal activity. Obligations to remove or block the use of information under general laws remain unaffected. However, liability in this regard is only possible from the point in time when a specific infringement is known. Upon becoming aware of such legal violations, we will remove this content immediately.",
    "liabilityForLinks": "Liability for Links",
    "linksDisclaimer": "Our offer contains links to external websites of third parties, over whose content we have no influence. Therefore, we cannot assume any liability for these external contents. The respective provider or operator of the pages is always responsible for the content of the linked pages. The linked pages were checked for possible legal violations at the time of linking. Illegal contents were not recognizable at the time of linking. A permanent content control of the linked pages is, however, not reasonable without concrete evidence of a violation of the law. If we become aware of any infringements, we will remove such links immediately.",
    "copyright": "Copyright",
    "copyrightNotice": "The content and works created by the site operators on these pages are subject to German copyright law. The duplication, editing, distribution, and any kind of exploitation outside the limits of copyright require the written consent of the respective author or creator. Downloads and copies of this site are only permitted for private, non-commercial use. Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected. In particular, third-party content is marked as such. Should you nevertheless become aware of a copyright infringement, please inform us accordingly. Upon becoming aware of legal violations, we will remove such content immediately.",
    "privacyPolicy": "Privacy Policy",
    "dataProtection": "The use of our website is generally possible without providing personal data. Insofar as personal data (e.g., name, address, or e-mail addresses) is collected on our pages, this is always done on a voluntary basis as far as possible. This data will not be passed on to third parties without your express consent.",
    "emailSecurity": "We would like to point out that data transmission over the Internet (e.g., when communicating by e-mail) can have security gaps. Complete protection of data against access by third parties is not possible.",
    "adDisclaimer": "The use of contact data published within the framework of the legal notice obligation by third parties for the transmission of not expressly requested advertising and information materials is hereby expressly prohibited. The operators of the pages expressly reserve the right to take legal action in the event of the unsolicited sending of advertising information, for example, through spam e-mails.",
    "generatedBy": "Website Legal Notice created by",
    "from": "from the"
  },
  "privacy": {
    "title": "Privacy Policy",
    "date": "As of September 22, 2024",
    "contents": "Table of Contents",
    "responsible": "Responsible Person",
    "name": "Mike Schauber",
    "address": "Edelmannsweg 62",
    "city": "72116 Mössingen",
    "email": "Email Address",
    "imprint": "Imprint",
    "processing_overview": "Overview of Processing",
    "processing_summary": "The following overview summarizes the types of processed data and the purposes of their processing.",
    "data_types": "Types of Data Processed",
    "data_types_1": "Contact Information (e.g., name, email)",
    "data_types_2": "User Account Data",
    "data_types_3": "Usage Data (e.g., IP address, browser type)",
    "data_types_4": "Content Data (e.g., messages, comments)",
    "data_types_5": "Communication Data",
    "data_types_6": "Meta/Communication Data",
    "data_subjects": "Categories of Data Subjects",
    "subjects_1": "Users of the service",
    "subjects_2": "Visitors to the website",
    "processing_purposes": "Purposes of Data Processing",
    "purpose_1": "Providing the service",
    "purpose_2": "Improving the service",
    "purpose_3": "Communication with users",
    "purpose_4": "Analysis and statistics",
    "purpose_5": "Security measures",
    "purpose_6": "Compliance with legal obligations",
    "legal_basis": "Legal Basis for Processing",
    "legal_basis_summary": "The processing of personal data is based on the following legal bases:",
    "legal_basis_details": "The specific legal basis for each processing activity depends on the context.",
    "contract_fulfillment": "Contract Fulfillment",
    "contract_fulfillment_details": "The processing is necessary for the performance of a contract with the data subject.",
    "legitimate_interests": "Legitimate Interests",
    "legitimate_interests_details": "The processing is necessary for the purposes of legitimate interests pursued by the responsible party.",
    "national_regulations": "National Regulations",
    "national_regulations_details": "In addition to the GDPR, other national data protection regulations may apply.",
    "notice_on_gdpr": "Notice on GDPR",
    "notice_on_gdpr_details": "Users have specific rights under the GDPR regarding their personal data.",
    "security_measures": "Security Measures",
    "security_measures_summary": "We take appropriate security measures to protect personal data.",
    "security_measures_details": "This includes technical and organizational measures to prevent unauthorized access and misuse.",
    "international_transfers": "International Data Transfers",
    "international_transfers_summary": "We may transfer personal data to countries outside the EU/EEA.",
    "eu_commission": "European Commission: International Dimension of Data Protection",
    "data_storage": "Data Storage",
    "data_storage_summary": "We store personal data only as long as necessary for the purposes stated.",
    "data_storage_exceptions": "Exceptions may apply based on legal obligations.",
    "data_storage_additional": "Further details on data storage and deletion can be found in our internal policies.",
    "data_storage_duration": "We will retain personal data for the duration necessary to fulfill the purposes for which we collected it.",
    "data_storage_start": "The storage period begins at the time of data collection.",
    "data_storage_purpose": "The data is stored for the purposes defined in this policy.",
    "additional_notes": "Additional Notes",
    "storage_terms": "Retention Periods",
    "storage_years": "years",
    "storage_years_business": "years for business data",
    "storage_years_contracts": "years for contract-related data",
    "rights": "Rights of Data Subjects",
    "rights_summary": "Data subjects have the following rights under data protection law:",
    "right_to_object": "Right to object to processing",
    "right_of_withdrawal": "Right to withdraw consent",
    "right_to_information": "Right to information",
    "right_to_correction": "Right to correction",
    "right_to_deletion": "Right to deletion",
    "right_to_data_transfer": "Right to data portability",
    "complaint": "Right to lodge a complaint with a supervisory authority.",
    "online_services": "Online Services",
    "online_services_summary": "We process personal data when you use our online services.",
    "processed_data": "Processed Data",
    "processed_data_details": "This may include registration data, usage data, and communication data.",
    "data_subjects_details": "Users of our online services.",
    "processing_purpose": "Purpose of Processing",
    "processing_purpose_details": "To provide and improve our services.",
    "storage_and_deletion": "Storage and Deletion",
    "storage_and_deletion_details": "Data will be stored as long as necessary and deleted thereafter.",
    "logfiles": "Logfiles",
    "logfiles_details": "Logfiles may be generated for security and analysis purposes.",
    "contact_management": "Contact Management",
    "contact_management_summary": "We process personal data when managing contacts.",
    "processed_data_types": "Types of Processed Data",
    "processed_data_types_details": "Contact information and communication data.",
    "data_subjects_contact": "Users who interact with us.",
    "processing_purpose_contact": "To manage and respond to inquiries.",
    "storage_and_deletion_contact": "Data will be stored and deleted according to legal requirements.",
    "legal_basis_contact": "Legal basis for processing contact data.",
    "contact_form": "Contact Form",
    "contact_details": "Details provided in the contact form will be processed.",
    "contact_details_info": "This may include name, email address, and message content.",
    "privacy_generator": "Generated with Datenschutz Generator",
    "generated_with": "Generated with the help of Datenschutz Generator"
  }
}
